Backend/app/controllers/user_profiles_controller.rb

SELECT "user_profiles".* FROM "user_profiles"
---
    def index
        @user_profiles = UserProfile.all

INSERT INTO "user_profiles" ("firstname", "middlename", "lastname", "email", "gender", "age", "national_id", "address", "phone", "county", "estate", "user_id", "career_summary", "experience", "education", "skills_and_hobbies", "languages", "image", "created_at", "updated_at", "experience_start_date", "experience_end_date", "education_start_date", "education_end_date") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"
---
    def create
        @user_profile = UserProfile.create!(user_profile_params)