Backend/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def create
        @user = User.new(user_params)
        if @user.save

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "1"], ["LIMIT", 1]]
---
    def find_user
        @user = User.find_by_username!(params[:_username])